tutorials/bm1.58n0.5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.25;
maxAlphaCo      0.25;

maxDeltaT       1;

functions
{
#includeIfPresent "../waveGaugesNProbes/surfaceElevation_controlDict";
  #include "forces";
/*    surfaceElevation
    {
        type               surfaceElevation;
        functionObjectLibs ( "libwaves2FoamSampling.so" );

        outputControl      timeStep; // Alternative: outputTime
        outputInterval     2;

        //Additional output controls in waves2Foam
        //samplingStartTime  -1;
        //surfaceSampleDeltaT 0.025;

        setFormat          raw;
        interpolationScheme cellPointFace;
        #include "fieldName"

        #includeIfPresent "../waveGaugesNProbes/surfaceElevation_sets";

    }*/
}

// ************************************************************************* //
